garyPenhook/PyAvrOCD/svd/avr32du32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLKCTRL</name>
      <description>Clock controller</description>
      <baseAddress>0x00800060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x7</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x25</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCLKCTRLA</name>
          <description>MCLK Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCHF</name>
                  <description>Internal high-frequency oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>Internal 32.768 kHz oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>32.768 kHz crystal oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT</name>
              <description>System clock out</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLB</name>
          <description>MCLK Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEN</name>
              <description>Prescaler enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIV</name>
              <description>Prescaler division</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <description>Divide by 6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <description>Divide by 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <description>Divide by 12</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV24</name>
                  <description>Divide by 24</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV48</name>
                  <description>Divide by 48</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLC</name>
          <description>MCLK Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFDEN</name>
              <description>Clock Failure Detect Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDTST</name>
              <description>Clock Failure Detect Test</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CFDSRC</name>
              <description>Clock Failure Detect Source</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKMAIN</name>
                  <description>Main Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHF</name>
                  <description>XOSCHF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>XOSC32K</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKINTCTRL</name>
          <description>MCLK Interrupt Control</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFD</name>
              <description>Clock Failure Detect Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>Interrupt type</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Regular Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKINTFLAGS</name>
          <description>MCLK Interrupt Flags</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFD</name>
              <description>Clock Failure Detect Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKSTATUS</name>
          <description>MCLK Status</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOSC</name>
              <description>System Oscillator changing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSCHFS</name>
              <description>High frequency oscillator status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC32KS</name>
              <description>32KHz oscillator status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XOSC32KS</name>
              <description>32.768 kHz Crystal Oscillator status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTS</name>
              <description>External Clock status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKTIMEBASE</name>
          <description>Timebase</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMEBASE</name>
              <description>Timebase</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32KCTRLA</name>
          <description>OSC32K Control A</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCHFCTRLA</name>
          <description>OSCHF Control A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTOTUNE</name>
              <description>Autotune</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Automatic tuning disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>Automatic tuning against XOSC32K enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOF</name>
                  <description>Automatic tuning against USB SOF enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRQSEL</name>
              <description>Frequency select</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1M</name>
                  <description>1 MHz system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>2 MHz system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3M</name>
                  <description>3 MHz system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>4 MHz system clock (default)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>8 MHz system clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12M</name>
                  <description>12 MHz system clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>16 MHz system clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20M</name>
                  <description>20 MHz system clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24M</name>
                  <description>24 MHz system clock</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALGSEL</name>
              <description>Algorithm Selection</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIN</name>
                  <description>Binary Search</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR</name>
                  <description>Incremental Search</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCHFSTATUS</name>
          <description>OSCHF Status</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ATSYNC</name>
              <description>Autotune in Lock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ATLOCK</name>
              <description>Autotune Synchronized</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCHFTUNE</name>
          <description>OSCHF Tune</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TUNE</name>
              <description>Tune</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>127</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPLLSTATUS</name>
          <description>PLL Status</description>
          <addressOffset>0x25</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PLLS</name>
              <description>PLL Stable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32KCTRLA</name>
          <description>XOSC32K Control A</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMODE</name>
              <description>Low power mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL</name>
              <description>Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>External crystal connected to the XTAL32K1 and XTAL32K2 pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock on the XTAL32K1 pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSUT</name>
              <description>Crystal startup time</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1k cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16k cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32k cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64k cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
